Revit 2026 API

# PathFailures Properties

---

The BuiltInFailuresPathFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Path3dRegenError | Picked Path could not be regenerated. |

#### Reference

BuiltInFailuresPathFailures Class

Autodesk.Revit.DB Namespace